armor66/ESP32-S3-Handset/3.6.0-S3-F27/src/tx_main.cpp
//my@new static void HandleUARTout()
// {
//   if (firmwareOptions.is_airport)
//   {
//     auto size = apOutputBuffer.size();
//     if (size)
//     {
//       uint8_t buf[size];
//       apOutputBuffer.lock();
//       apOutputBuffer.popBytes(buf, size);
//       apOutputBuffer.unlock();
//       TxUSB->write(buf, size);
//     }
//   }
// }

//my@new static void HandleUARTin()
// {
//   Read from the USB serial port
//   if (TxUSB->available())
//   {
//     if (firmwareOptions.is_airport)
//     {
//       auto size = std::min(apInputBuffer.free(), (uint16_t)TxUSB->available());
//       if (size > 0)
//       {
//         uint8_t buf[size];
//         TxUSB->readBytes(buf, size);
//         apInputBuffer.lock();
//         apInputBuffer.pushBytes(buf, size);
//         apInputBuffer.unlock();
//       }
//     }
//     else
//     {
//       auto size = std::min(uartInputBuffer.free(), (uint16_t)TxUSB->available());
//       if (size > 0)
//       {
//         uint8_t buf[size];
//         TxUSB->readBytes(buf, size);
//         uartInputBuffer.lock();
//         uartInputBuffer.pushBytes(buf, size);
//         uartInputBuffer.unlock();

//         // Lets check if the data is Mav and auto change LinkMode
//         // Start the hwTimer since the user might be operating the module as a standalone unit without a handset.
//         if (connectionState == noCrossfire)
//         {
//           if (isThisAMavPacket(buf, size))
//           {
//             config.SetLinkMode(TX_MAVLINK_MODE);
//             UARTconnected();
//           }
//         }
//       }
//     }
//   }

//   Read from the Backpack serial port
//   if (TxBackpack->available())
//   {
//     auto size = std::min(uartInputBuffer.free(), (uint16_t)TxBackpack->available());
//     if (size > 0)
//     {
//       uint8_t buf[size];
//       TxBackpack->readBytes(buf, size);

//       // If the TX is in Mavlink mode, push the bytes into the fifo buffer
//       if (config.GetLinkMode() == TX_MAVLINK_MODE)
//       {
//         uartInputBuffer.lock();
//         uartInputBuffer.pushBytes(buf, size);
//         uartInputBuffer.unlock();

//         // The tx is in Mavlink mode and receiving data from the Backpack.
//         // Start the hwTimer since the user might be operating the module as a standalone unit without a handset.
//         if (connectionState == noCrossfire)
//         {
//           if (isThisAMavPacket(buf, size))
//           {
//             UARTconnected();
//           }
//         }
//       }

//       // Try to parse any MSP packets from the Backpack
//       ParseMSPData(buf, size);
//     }
//   }
// }

static void setupSerial()
{  /*
   * Setup the logging/backpack serial port, and the USB serial port.
   * This is always done because we need a place to send data even if there is no backpack!
   */

// Setup TxBackpack
#if defined(PLATFORM_ESP32)
  Stream *serialPort;

  if(firmwareOptions.is_airport)
  {
    serialPort = new HardwareSerial(1);
    ((HardwareSerial *)serialPort)->begin(firmwareOptions.uart_baud, SERIAL_8N1, U0RXD_GPIO_NUM, U0TXD_GPIO_NUM);
  }
  else if (GPIO_PIN_DEBUG_RX != UNDEF_PIN && GPIO_PIN_DEBUG_TX != UNDEF_PIN)
  {
    serialPort = new HardwareSerial(2);
    ((HardwareSerial *)serialPort)->begin(BACKPACK_LOGGING_BAUD, SERIAL_8N1, GPIO_PIN_DEBUG_RX, GPIO_PIN_DEBUG_TX);
  }
  else
  {
    serialPort = new NullStream();
  }
#elif defined(PLATFORM_ESP8266)
  Stream *serialPort;
  if (GPIO_PIN_DEBUG_TX != UNDEF_PIN)
  {
    serialPort = new HardwareSerial(1);
    ((HardwareSerial*)serialPort)->begin(BACKPACK_LOGGING_BAUD, SERIAL_8N1, SERIAL_TX_ONLY, GPIO_PIN_DEBUG_TX);
  }
  else
  {
    serialPort = new NullStream();
  }
#elif defined(TARGET_TX_FM30)
  #if defined(PIO_FRAMEWORK_ARDUINO_ENABLE_CDC)
    USBSerial *serialPort = &SerialUSB; // No way to disable creating SerialUSB global, so use it
    serialPort->begin();
  #else
    Stream *serialPort = new NullStream();
  #endif
#elif (defined(GPIO_PIN_DEBUG_RX) && GPIO_PIN_DEBUG_RX != UNDEF_PIN) || (defined(GPIO_PIN_DEBUG_TX) && GPIO_PIN_DEBUG_TX != UNDEF_PIN)
  HardwareSerial *serialPort = new HardwareSerial(2);
  #if defined(GPIO_PIN_DEBUG_RX) && GPIO_PIN_DEBUG_RX != UNDEF_PIN
    serialPort->setRx(GPIO_PIN_DEBUG_RX);
  #endif
  #if defined(GPIO_PIN_DEBUG_TX) && GPIO_PIN_DEBUG_TX != UNDEF_PIN
    serialPort->setTx(GPIO_PIN_DEBUG_TX);
  #endif
  serialPort->begin(BACKPACK_LOGGING_BAUD);
#else
  Stream *serialPort = new NullStream();
#endif
  TxBackpack = serialPort;

#if defined(PLATFORM_ESP32_S3) || defined(PLATFORM_ESP32_C3)
  Serial.begin(460800);
#endif

// Setup TxUSB
#if defined(PLATFORM_ESP32_S3) || defined(PLATFORM_ESP32_C3)
  USBSerial.begin(firmwareOptions.uart_baud);
  TxUSB = &USBSerial;
#elif defined(PLATFORM_ESP32)
  if (GPIO_PIN_DEBUG_RX == U0RXD_GPIO_NUM && GPIO_PIN_DEBUG_TX == U0TXD_GPIO_NUM)
  {
    // The backpack or Airpoirt is already assigned on UART0 (pins 3, 1)
    // This is also USB on modules that use DIPs
    // Set TxUSB to TxBackpack so that data goes to the same place
    TxUSB = TxBackpack;
  }
  else if (GPIO_PIN_RCSIGNAL_RX == U0RXD_GPIO_NUM && GPIO_PIN_RCSIGNAL_TX == U0TXD_GPIO_NUM)
  {
    // This is an internal module, or an external module configured with a relay.  Do not setup TxUSB.
    TxUSB = new NullStream();
  }
  else
  {
    // The backpack is on a separate UART to UART0
    // Set TxUSB to pins 3, 1 so that we can access TxUSB and TxBackpack independantly
    TxUSB = new HardwareSerial(1);
    ((HardwareSerial *)TxUSB)->begin(firmwareOptions.uart_baud, SERIAL_8N1, U0RXD_GPIO_NUM, U0TXD_GPIO_NUM);
  }
#else
  TxUSB = new NullStream();
#endif
}

/**
 * Target-specific initialization code called early in setup()
 * Setup GPIOs or other hardware, config not yet loaded
 ***/
static void setupTarget()
{
  if (GPIO_PIN_ANT_CTRL != UNDEF_PIN)
  {
    pinMode(GPIO_PIN_ANT_CTRL, OUTPUT);
    digitalWrite(GPIO_PIN_ANT_CTRL, diversityAntennaState);
  }
  if (GPIO_PIN_ANT_CTRL_COMPL != UNDEF_PIN)
  {
    pinMode(GPIO_PIN_ANT_CTRL_COMPL, OUTPUT);
    digitalWrite(GPIO_PIN_ANT_CTRL_COMPL, !diversityAntennaState);
  }

  setupSerial();
  setupTargetCommon();
}

bool setupHardwareFromOptions()
{
#if defined(TARGET_UNIFIED_TX)
  if (!options_init())
  {
    // Register the WiFi with the framework
    static device_affinity_t wifi_device[] = {
        {&WIFI_device, 1}
    };
    devicesRegister(wifi_device, ARRAY_SIZE(wifi_device));
    devicesInit();

    connectionState = hardwareUndefined;
    return false;
  }
#else
  options_init();
#endif

