armor66/ESP32-S3-Handset/3.6.0-S3-F27/src/tx_main.cpp
  return true;
}

static void setupBindingFromConfig()
{
  if (firmwareOptions.hasUID)
  {
      memcpy(UID, firmwareOptions.uid, UID_LEN);
  }
  else
  {
#ifdef PLATFORM_ESP32
    esp_read_mac(UID, ESP_MAC_WIFI_STA);
#elif PLATFORM_ESP8266
    wifi_get_macaddr(STATION_IF, UID);
#elif PLATFORM_STM32
    UID[0] = (uint8_t)HAL_GetUIDw0();
    UID[1] = (uint8_t)(HAL_GetUIDw0() >> 8);
    UID[2] = (uint8_t)HAL_GetUIDw1();
    UID[3] = (uint8_t)(HAL_GetUIDw1() >> 8);
    UID[4] = (uint8_t)HAL_GetUIDw2();
    UID[5] = (uint8_t)(HAL_GetUIDw2() >> 8);
#endif
  }

  DBGLN("UID=(%d, %d, %d, %d, %d, %d)",
    UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

  OtaUpdateCrcInitFromUid();
}


static void cyclePower()
{
  // Only change power if we are running normally
  if (connectionState < MODE_STATES)
  {
    PowerLevels_e curr = POWERMGNT::currPower();
    if (curr == POWERMGNT::getMaxPower())
    {
      POWERMGNT::setPower(POWERMGNT::getMinPower());
    }
    else
    {
      POWERMGNT::incPower();
    }
  }
}

void setup()
{
  if (setupHardwareFromOptions())
  {
    setupTarget();
    // Register the devices with the framework
    devicesRegister(ui_devices, ARRAY_SIZE(ui_devices));
    // Initialise the devices
    devicesInit();
    DBGLN("Initialised devices");

    setupBindingFromConfig();
    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    Radio.RXdoneCallback = &RXdoneISR;
    Radio.TXdoneCallback = &TXdoneISR;

    handset->registerCallbacks(UARTconnected, firmwareOptions.is_airport ? nullptr : UARTdisconnected, ModelUpdateReq, EnterBindingModeSafely);

    DBGLN("ExpressLRS TX Module Booted...");

    eeprom.Begin(); // Init the eeprom
    config.SetStorageProvider(&eeprom); // Pass pointer to the Config class for access to storage
    config.Load(); // Load the stored values from eeprom

    Radio.currFreq = FHSSgetInitialFreq(); //set frequency first or an error will occur!!!
    #if defined(RADIO_SX127X)
    //Radio.currSyncWord = UID[3];
    #endif
    bool init_success;
    #if defined(USE_BLE_JOYSTICK)
    init_success = true; // No radio is attached with a joystick only module.  So we are going to fake success so that crsf, hwTimer etc are initiated below.
    #else
    if (GPIO_PIN_SCK != UNDEF_PIN)
    {
      init_success = Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());
    }
    else
    {
      // Assume BLE Joystick mode if no radio SCK pin
      init_success = true;
    }
    #endif

    if (!init_success)
    {
      connectionState = radioFailed;
    }
    else
    {
      TelemetryReceiver.SetDataToReceive(CRSFinBuffer, sizeof(CRSFinBuffer));

      POWERMGNT::init();
      DynamicPower_Init();

      // Set the pkt rate, TLM ratio, and power from the stored eeprom values
      ChangeRadioParams();

  #if defined(Regulatory_Domain_EU_CE_2400)
      SetClearChannelAssessmentTime();
  #endif
      hwTimer::init(nullptr, timerCallback);
      connectionState = noCrossfire;
    }
  }
  else
  {
    // In the failure case we set the logging to the null logger so nothing crashes
    // if it decides to log something
    TxBackpack = new NullStream();
    TxUSB = TxBackpack;
  }

#if defined(HAS_BUTTON)
  registerButtonFunction(ACTION_BIND, EnterBindingMode);
  registerButtonFunction(ACTION_INCREASE_POWER, cyclePower);
#endif

  devicesStart();

  if (firmwareOptions.is_airport)
  {
    config.SetTlm(TLM_RATIO_1_2); // Force TLM ratio of 1:2 for balanced bi-dir link
    config.SetMotionMode(0); // Ensure motion detection is off
    UARTconnected();
  }
  UARTconnected(); //my@new just pretend to execute it
}

void loop()
{
  uint32_t now = millis();

  //my@new HandleUARTout(); // Only used for non-CRSF output

  #if defined(USE_BLE_JOYSTICK)
  if (connectionState != bleJoystick && connectionState != noCrossfire) // Wait until the correct crsf baud has been found
  {
      connectionState = bleJoystick;
  }
  #endif

  if (connectionState < MODE_STATES)
  {
    UpdateConnectDisconnectStatus();
  }

  // Update UI devices
/*my@new to prevent abrupt halt when wifiUpdate or move it after >MODE_STATES clause*/
  if(connectionState != wifiUpdate) devicesUpdate(now);

  // Not a device because it must be run on the loop core
  //my@new checkBackpackUpdate();

  // #if defined(PLATFORM_ESP8266) || defined(PLATFORM_ESP32)
    // If the reboot time is set and the current time is past the reboot time then reboot.
    if (rebootTime != 0 && now > rebootTime) {
      ESP.restart();
    }
  // #endif

  executeDeferredFunction(micros());

  //my@new HandleUARTin();

  if (connectionState > MODE_STATES)
  {
    return;
  }

  CheckReadyToSend();
  CheckConfigChangePending();
  DynamicPower_Update(now);
  VtxPitmodeSwitchUpdate();

  /* Send TLM updates to handset if connected + reporting period
   * is elapsed. This keeps handset happy dispite of the telemetry ratio */
  // if((connectionState == connected) && (LastTLMpacketRecvMillis != 0) &&
  //   (now >= (uint32_t)(firmwareOptions.tlm_report_interval + TLMpacketReported)))
  if(isRXconnected)  //after ever telemetry packet received
  {
    // uint8_t linkStatisticsFrame[CRSF_FRAME_NOT_COUNTED_BYTES + CRSF_FRAME_SIZE(sizeof(crsfLinkStatistics_t))];
    // CRSFHandset::makeLinkStatisticsPacket(linkStatisticsFrame);
    // handset->sendTelemetryToTX(linkStatisticsFrame);     //to handset
    // sendCRSFTelemetryToBackpack(linkStatisticsFrame);    //to uart, just for test
   isRXconnected = false;
    TLMpacketReported = now;
  }

  if (TelemetryReceiver.HasFinishedData())
  {
    // if (CRSFinBuffer[0] == CRSF_ADDRESS_USB)
      // {
      //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
      //   {
      //     // raw mavlink data - forward to USB rather than handset
      //     uint8_t count = CRSFinBuffer[1];
      //     // Convert to CRSF telemetry where we can
      //     convert_mavlink_to_crsf_telem(CRSFinBuffer, count, handset);
      //     TxUSB->write(CRSFinBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
      //     // If we have a backpack
      //     if (TxUSB != TxBackpack)
      //     {
      //       sendMAVLinkTelemetryToBackpack(CRSFinBuffer);
      //     }
      //   }
      // }
      // else
      // {
        // Send all other tlm to handset
      // handset->sendTelemetryToTX(CRSFinBuffer);      //to handset
      // sendCRSFTelemetryToBackpack(CRSFinBuffer);     //to uart, merely to confirm
      // }
      if (CRSFinBuffer[0] == 0xC8)
      {
        if(CRSFinBuffer[2] == 0x08)
        {
          airBat_Val = CRSFinBuffer[4];
        }
        else if(CRSFinBuffer[2] == 0x21)
        {
          for(uint8_t i = 0; i < (CRSFinBuffer[1] - 2); ++i)
          {
            flightMode[i] = CRSFinBuffer[i + 3];
          }
        }
      }
      TelemetryReceiver.Unlock();
  }

  if ((now - TLMpacketReported) > 3000)   //RX_CONNECTION_LOST_TIMEOUT)
  {
    airBat_Val = 0;
    memset(flightMode, 0, 8);
  }

  // static bool mspTransferActive = false;    //guess should move out of "loop"
  // only send msp data when binding is not active
  if (InBindingMode)
  {
#if defined(RADIO_LR1121)
    // Send half of the bind packets on the 2.4GHz domain
    if (BindingSendCount == BindingSpamAmount / 2) {
      SetRFLinkRate(RATE_DUALBAND_BINDING);
      // Increment BindingSendCount so that SetRFLinkRate is only called once.
      BindingSendCount++;
    }
#endif
    // exit bind mode if package after some repeats
    if (BindingSendCount > BindingSpamAmount) {
      ExitBindingMode();
    }
  }
  else if (!MspSender.IsActive())
  {
    // sending is done and we need to update our flag
    if (mspTransferActive)
    {
      // unlock buffer for msp messages
      CRSF::UnlockMspMessage();
      mspTransferActive = false;
    }
    // we are not sending so look for next msp package
    else
    {
      //model match state changed locally in config.cpp/TxConfig::SetModelMatch_ST
      if(modelChanged) 
      {
        modelChanged = false;
        modelMatchToMsp();    //defined in lib/VTX/devVTX. file
      }

      uint8_t* mspData;
      uint8_t mspLen;
      CRSF::GetMspMessage(&mspData, &mspLen);
      // if we have a new msp package start sending
      if (mspData != nullptr)
      {
        sendCRSFTelemetryToBackpack(mspData);   //to uart, merely to confirm
        MspSender.SetDataToTransmit(mspData, mspLen);
        mspTransferActive = true;
      }
    }
  }

  // if (config.GetLinkMode() == TX_MAVLINK_MODE)
  // {
  //   // Use MspSender for MAVLINK uplink data
  //   uint8_t *nextPayload = 0;
  //   uint8_t nextPlayloadSize = 0;
  //   uint16_t count = uartInputBuffer.size();
  //   if (count > 0 && !MspSender.IsActive())
  //   {
  //       count = std::min(count, (uint16_t)CRSF_PAYLOAD_SIZE_MAX);
  //       mavlinkSSBuffer[0] = MSP_ELRS_MAVLINK_TLM; // Used on RX to differentiate between std msp opcodes and mavlink
  //       mavlinkSSBuffer[1] = count;
  //       // Following n bytes are just raw mavlink
  //       uartInputBuffer.lock();
  //       uartInputBuffer.popBytes(mavlinkSSBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
  //       uartInputBuffer.unlock();
  //       nextPayload = mavlinkSSBuffer;
  //       nextPlayloadSize = count + CRSF_FRAME_NOT_COUNTED_BYTES;
  //       MspSender.SetDataToTransmit(nextPayload, nextPlayloadSize);
  //   }
  // }
}
